In [49]:
scores_list = [65,70,85,90,75]

scores_list+5

   math  english
0    70       68
1    85       88
2    78       75
3    90       92

In [13]:
new_scores = []
for s in scores_list:
    new_scores.append(s+5)
new_scores

[70, 75, 90, 95, 80]

In [15]:
import numpy as np

scores = np.array([65,70,85,90,75])

scores+5

array([70, 75, 90, 95, 80])

In [17]:
scores.shape

(5,)

In [18]:
scores.size

5

In [19]:
scores.dtype

dtype('int64')

In [28]:
scores2 = np.array([
    [80,90,100],
    [60,50,90],
    [60,50,90]
])

print(scores2.shape,"\n", scores2.size,"\n",scores2.dtype)

(3, 3)
 9
 int64

In [42]:
print(scores)
scores[:1]

[65 70 85 90 75]

array([65])

In [43]:
scores[scores>75]

array([85, 90])

In [44]:
np.mean(scores)

np.float64(77.0)

In [45]:
np.median(scores)

np.float64(75.0)

In [46]:
A = np.array([68,69,70,71,72])
B = np.array([40,50,70,90,100])

np.mean(A),np.mean(B)

(np.float64(70.0), np.float64(70.0))

In [47]:
np.std(A),np.std(B)

(np.float64(1.4142135623730951), np.float64(22.80350850198276))

In [50]:
import pandas as pd

df = pd.DataFrame({
    "math":[70,85,78,90],
    "english":[68,88,75,92]
})
df

   math  english
0    70       68
1    85       88
2    78       75
3    90       92

In [54]:
df.head(2)

   math  english
0    70       68
1    85       88

In [53]:
df.shape

(4, 2)

In [55]:
df.columns

Index(['math', 'english'], dtype='object')

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   math     4 non-null      int64
 1   english  4 non-null      int64
dtypes: int64(2)
memory usage: 196.0 bytes

In [57]:
df.describe()

            math    english
count   4.000000   4.000000
mean   80.750000  80.750000
std     8.693868  11.176612
min    70.000000  68.000000
25%    76.000000  73.250000
50%    81.500000  81.500000
75%    86.250000  89.000000
max    90.000000  92.000000

In [58]:
df["math"]

0    70
1    85
2    78
3    90
Name: math, dtype: int64

In [60]:
df[["math","english"]]

   math  english
0    70       68
1    85       88
2    78       75
3    90       92

In [65]:
df["average"] = (df["math"]+df["english"])/2
df

   math  english  average
0    70       68     69.0
1    85       88     86.5
2    78       75     76.5
3    90       92     91.0

In [66]:
df[df["average"]>=75]

   math  english  average
1    85       88     86.5
2    78       75     76.5
3    90       92     91.0

In [68]:
df[df["average"]<=90]

   math  english  average
0    70       68     69.0
1    85       88     86.5
2    78       75     76.5